<S>
</S>
<UNK>
21224
8197
15274
7664
7706
4246
19311
14123
12772
12617
1027
3948
16512
21097
10925
11123
19421
4846
4216
159
3166
6102
2699
9391
10789
7384
18826
16046
5163
17219
17145
16496
17597
13751
15822
2128
2289
20027
16712
17186
2819
18538
19006
5025
11255
2034
20451
9779
4859
20583
14126
20359
17681
3452
17166
12062
15345
14937
4104
14077
13513
6754
3445
10609
2379
10341
13670
13552
14091
16201
20170
19215
20743
1856
6967
14477
20620
17565
3253
8649
14459
3009
13494
17325
16980
15020
16806
567
4106
1961
13781
20958
2969
20859
3277
954
19365
18158
2649
19184
11664
12943
13519
1886
11642
14747
4921
882
6006
6196
14812
19285
4718
6303
13553
9088
17225
16805
3988
1668
9906
3545
4779
11188
6254
6112
6642
1847
5863
17592
13862
10092
17083
1819
16374
15426
7938
7747
16688
4688
8387
18199
7106
7649
15788
8487
10223
9007
586
533
19936
6000
3647
15556
20813
18571
14360
10037
12302
13614
14499
16419
968
16929
7047
14244
15060
13309
13426
16113
2240
8217
6051
19675
16654
2658
11033
15785
7379
3380
19934
9954
12172
2003
2250
14478
6437
17808
9732
16435
12851
5379
15140
10072
15034
9199
5808
19258
17337
19425
7501
7251
20815
4387
9887
8379
3424
11806
7105
20279
14978
6991
19832
17427
20600
13487
6478
19638
8064
19453
19851
15582
12610
14199
8373
11122
1965
5759
8617
12751
6625
17964
17348
13940
14253
46
5190
3133
400
10158
18736
17304
4929
4935
20573
17667
17370
16362
2483
16546
3191
1173
5391
9005
10627
10512
11167
5870
11581
8505
695
7438
14132
20808
16979
7230
10571
1223
3061
11972
17622
3083
2557
3028
11685
17759
12607
18802
927
18705
2680
17047
19302
10841
4703
18799
19616
4223
10455
6891
6312
6299
2797
19061
15718
14498
5026
9701
9433
15492
11103
297
15762
2643
7990
8489
3738
4954
4758
4190
10690
13248
14640
8344
19877
5985
18053
6522
19120
4808
10920
23
875
511
4948
13529
5626
10399
16816
19864
19356
2702
9211
18288
16327
19853
13046
10870
11068
15692
3999
2771
8572
9187
10777
20544
11924
10332
3809
1353
10536
1488
15212
5810
11743
14675
974
1519
5908
2161
14346
9460
8885
4886
13664
14033
17457
5930
2896
18620
18496
497
4243
9679
11331
8038
14358
12266
4077
17624
6484
6306
11735
14277
17600
15964
5390
13821
17359
8952
17732
9267
11746
4616
11543
6384
20201
16498
18173
204
13159
2041
13129
16885
15287
13170
14582
3047
4244
1984
15372
16623
13317
17516
6181
17789
10516
21145
6858
12333
19529
6255
709
9942
659
18094
6733
861
1866
12911
2764
7040
8041
15462
21125
14722
15712
12540
286
537
9442
10903
4513
962
15033
13040
6258
17126
4840
8467
4988
7380
18952
2869
7420
12721
6471
5368
20129
9350
13146
18282
10938
20148
4581
5736
6600
19127
14790
19534
4750
19907
4570
11384
7020
6623
10270
19172
15041
1514
18038
14803
6353
11996
14867
13696
58
971
18660
20048
18016
18781
2849
2438
19315
5635
5966
19543
14658
3441
5616
17031
14564
17532
8715
14286
2641
17159
14422
15655
16077
17735
13924
1457
9860
7069
13968
2256
16093
8808
8428
6164
162
6201
11249
21131
15799
18102
6068
19828
4204
12252
3248
17506
6682
14169
17409
11553
9233
9180
10869
12469
20611
4250
15574
9254
21115
11990
2432
10619
9312
13004
9186
11043
1801
7917
3510
9629
17831
7199
4275
2242
5557
16369
20684
13711
17773
5815
1250
7942
19752
3421
18057
9499
11378
9089
18732
6329
5797
13550
160
708
3768
9933
1939
18059
12164
5332
6594
20790
16288
768
14796
8141
11530
8354
5018
18850
10247
19429
12093
4864
7659
9452
7769
9481
6042
5156
6135
4350
14313
10763
19952
15324
8112
17281
6574
21195
632
4211
12788
12299
689
6463
17939
10083
17000
18103
19987
14903
19200
3323
11329
15428
19536
19234
20588
19247
4034
19181
15838
14839
3486
8077
17851
6523
6040
1032
20667
2709
4967
132
17909
11385
1911
3625
8523
11367
3267
11499
7432
5067
19134
18097
19415
14523
15920
7523
17712
9473
10075
20440
10520
14784
18056
14815
6174
19807
10729
16217
9001
15950
7007
20168
19229
1784
4273
8551
19977
19224
9220
3967
4191
18100
3935
17136
15913
6997
5008
5157
16722
14949
20365
8110
17834
19092
17682
18341
634
10427
416
8691
2485
20470
3976
7096
12985
4089
15259
16254
10229
7232
16687
5852
16108
304
8179
2273
20224
11605
3862
2457
6839
18958
10965
9576
7994
10432
13544
7700
18659
19618
4526
700
7629
21178
2830
6225
16222
15671
11099
20449
8806
7820
19813
20284
2984
18928
19735
1827
8868
20138
15915
17488
12643
7529
18430
5724
15699
11431
17885
3786
717
1166
1215
1269
6601
635
9479
11310
9405
1581
9401
4183
10545
19074
9675
12664
19808
19592
2729
10803
2203
5848
10063
14723
3868
11133
9921
10765
18641
16873
11622
8325
12992
9079
9361
2696
10141
16718
20372
16110
16789
959
19204
8317
16948
16195
17705
6086
15673
16906
19776
1769
13789
18535
4487
14642
13280
10524
13843
1625
4167
14854
21215
1884
1749
3249
3157
18393
2974
7593
4163
6005
10352
9298
9685
14350
4114
3134
983
13593
3888
20411
16105
17475
8814
16872
16357
20827
15874
6706
20691
7995
4615
14039
15193
2568
12488
984
2422
14481
3343
20312
12307
3007
20247
13014
16993
20035
13623
17104
5457
8584
11934
15898
15294
3970
12666
7518
6092
7731
4528
14320
11487
18318
12082
9910
9409
1033
6930
10000
20310
16550
13092
6850
9221
5717
18988
11505
14085
20869
1043
2513
20725
2276
17019
10013
8640
336
2361
12884
241
7411
1059
13480
21141
15025
16138
2051
19716
6130
13135
10800
18971
13002
18699
8907
7647
14684
7605
19665
14908
6036
10850
16730
964
957
14002
9655
11250
15709
18771
12850
3981
18372
19214
8746
16449
4530
2492
15612
18128
18403
897
16679
581
13514
7859
4598
3454
9249
4091
16957
5540
19570
3468
5647
18347
17797
19370
14461
8738
19823
18101
12193
14714
10962
3872
14196
13851
10134
11541
18962
2473
1969
15669
3431
12256
10951
21023
15465
7111
890
16468
13534
1966
3722
670
16879
11689
13221
14464
3682
17765
10671
18113
7684
11702
6093
8033
12474
3669
20821
12052
10226
19316
9068
6422
18593
21163
16908
11679
20733
13964
9730
4218
1595
18241
20732
6710
12659
16149
3642
20849
19024
5918
9234
4509
15468
18474
19479
538
6229
13767
16820
18830
6816
8358
11652
15594
3310
16199
1274
1432
17606
12228
17441
12083
31
10890
1898
18968
9070
18541
17998
5711
787
17430
3662
14971
8743
8891
12502
9435
18222
11727
1910
1278
10272
2801
6443
5564
15978
15596
2604
10293
16866
5323
9901
12518
15580
2052
2687
16341
4893
16061
11927
10575
4150
14309
10985
12080
15682
1146
18330
6018
2668
11276
14428
21052
7755
10053
8333
19976
8122
2008
2135
11557
10249
19916
19222
4140
6088
10754
6060
5227
7255
12541
9661
19741
11198
17228
7377
9741
5718
2402
12324
364
21035
1511
19517
9056
15833
357
4939
2997
8792
7272
8014
19890
3621
2881
21209
1727
942
16075
2076
18227
11309
11612
3596
9279
21155
11185
1702
18521
10720
11196
20298
6662
8772
356
12797
9683
607
1260
5330
21082
9717
7236
10940
18485
11634
19552
14673
542
1308
13010
8637
10699
3591
7672
20707
15629
4229
10706
5779
17363
5470
15111
6736
378
3219
1530
21046
1046
18941
4517
14930
16073
18551
8601
14383
4545
14146
11300
7941
6540
11352
4767
13333
3568
2573
11656
9327
1016
15227
2083
17813
17220
10355
3500
1054
10807
9600
10537
17956
16784
5857
8154
12550
2822
685
16710
3122
15260
4432
9196
8789
6610
20172
10589
13680
19090
18894
234
4481
13582
5537
20393
4875
75
9443
20380
15567
8337
17296
4903
11659
8456
13966
10204
5844
17691
11865
19041
3268
4493
11221
4271
10259
5884
1639
6916
15293
2525
9697
20901
1598
21025
13266
15758
6003
15349
11298
15828
20426
17863
18054
12470
8794
6765
21117
17389
4088
5861
5767
10886
7802
4200
11061
11277
19174
9253
12076
2625
1942
16534
20353
6057
12294
10240
4720
10532
200
6919
11407
13549
10450
11882
16653
11230
7427
6519
14205
4797
15836
3043
19629
1815
5188
10865
9178
13449
7104
4685
18487
1368
17634
10100
15163
10997
3295
18577
11476
8913
18574
19759
2508
9772
3873
14119
17320
10686
5172
9422
6013
14270
18425
10393
17850
14303
20124
6156
6677
13667
3341
16535
14063
17114
9418
5687
11334
8316
453
5475
12057
19654
14862
9865
5013
5885
8893
9463
16312
20507
15074
19457
14840
7571
12253
17899
13565
17473
13753
16773
12241
19786
16655
417
16032
11945
16086
15210
19792
6724
7982
2664
9067
13503
6803
12026
8734
12622
9770
7805
18782
21152
10635
3024
16262
11860
1660
12936
16010
7448
15352
3069
10957
3893
15004
19520
15875
20717
1716
4166
8883
14868
11755
2087
13085
15100
11773
12141
16709
17820
10815
12757
19354
16585
3652
17040
20795
7212
14632
6148
3778
11922
1893
7118
1719
18448
17996
3620
18212
10339
5424
20464
19766
16150
14977
5850
13358
17514
18780
19955
4938
440
17559
14059
734
18250
9552
1309
8608
17154
8289
20354
3940
19794
5312
1354
9718
12257
17456
4830
192
2396
10511
19972
8732
7344
7012
7270
18004
14537
68
13706
9167
9674
15997
3660
17405
4149
16456
16643
15138
8397
15899
20955
18005
8194
6507
18126
772
152
3871
20518
3576
10376
19707
755
2812
12508
18202
9590
18205
17005
7139
9810
20238
11784
715
19375
13034
9596
20350
4169
14250
13758
21168
16228
16951
13573
16367
8231
7726
5665
14530
16876
123
19443
20268
17204
14738
16109
4682
10504
5871
16243
18740
7217
4925
18811
270
6608
2948
11470
13669
12983
21086
13634
3889
6023
20400
8554
15744
3027
19206
11645
7244
3533
16225
11421
7248
980
15493
5076
19626
14576
4096
18652
19286
19705
17274
15198
8081
13278
19962
1571
5949
10868
16574
1366
17453
16853
7545
6186
17305
1169
10922
9396
16470
19133
6235
20730
20627
9322
10847
20755
15491
18996
11910
7356
8331
13087
16328
19474
17392
15449
18333
13918
19896
20884
8884
19465
18677
13139
4060
16068
7735
4264
6756
289
17807
18837
3641
12505
4119
832
16614
16541
12561
839
9825
10562
19220
5185
18597
14843
19209
8624
18764
10463
10051
20158
6393
4294
6835
13938
10531
11498
585
880
5155
10689
12755
18194
15994
2578
18389
17023
9657
7081
18570
2772
13262
9688
1202
18443
8949
1751
19291
7495
19852
16127
6741
7707
1424
18872
9799
16284
691
19113
4125
18829
1944
7035
7679
7762
3875
11555
5477
16294
13817
9307
10078
16509
9763
18693
8771
9968
5092
16769
7665
9987
13324
12305
12394
13300
8415
9269
18080
2297
10696
16889
16305
20537
2863
13425
15495
2104
17878
19734
10121
5276
19431
8993
5940
18932
20478
9998
11340
12844
15782
15862
14397
17253
5365
2543
13717
6033
17629
13396
13470
2238
19643
14778
3105
13682
8529
7009
15595
5269
2569
4815
781
13906
6072
13931
19961
938
15362
1567
130
13406
17388
20192
17271
18695
8147
16622
14621
5523
19337
3906
1188
20119
20503
15851
4112
3199
15116
12111
422
12766
4288
2632
9344
14913
6365
1705
7640
2066
13395
9027
4659
5175
8926
17591
2996
21042
2924
6666
13116
17444
3752
21208
16720
13173
13742
20982
7142
17602
18498
20923
9343
5296
16664
10563
14864
4725
16074
10387
21120
15944
13994
2715
9022
7391
16864
20972
11919
8370
7549
6911
11415
9308
19237
4757
18475
6653
6134
11253
20137
18572
8347
10975
15182
7080
5112
13193
6286
3785
18391
5688
8950
19138
12520
21182
16839
1869
3895
19
327
14236
4555
18045
8324
13124
20692
16407
6417
7053
277
1531
7897
9423
3251
20909
16394
4032
2503
20347
11350
20970
15105
1539
7552
5480
10447
15951
13298
3182
7268
5028
5342
15900
11774
6772
354
2640
20522
814
7912
11770
4932
12360
11646
7
2686
257
10866
4613
13321
13989
9286
14403
10179
6491
6291
933
7573
9876
9909
10894
20067
13546
3073
20024
14770
7677
18127
18882
5639
20401
17252
8533
12157
4931
10645
16163
19803
20992
18437
19282
18658
2108
20235
18262
14051
4873
2036
11489
595
4057
17775
11586
2089
2086
18973
629
15097
9215
15042
1611
17064
15666
5348
19283
17638
3137
3861
6596
15897
15893
10325
16275
8853
462
3110
19180
16849
13957
13218
17949
14488
13728
6635
3119
13460
18131
17070
9577
15681
1708
16166
19560
13916
5003
15541
2912
20759
17057
1426
10467
14501
944
1885
5745
2095
1097
14271
14848
4473
4648
15166
12566
19863
5953
9171
10845
4531
16285
15172
20456
9780
10872
16800
20333
6603
14985
3937
19732
6456
13597
10459
2554
1852
4376
20833
17408
19066
2213
13152
7388
5201
7133
774
11
2411
14519
8363
11787
15340
14834
17870
11964
9488
19527
17168
7979
1330
1474
10337
4122
8881
13956
13194
18319
17090
17178
9689
10936
6649
20441
5444
6109
4819
20513
5510
21172
8819
14094
13803
3167
20572
12162
2738
14752
10461
19632
20226
10557
8575
12184
16694
20519
2219
11944
5599
16377
5543
16955
4563
9698
5743
3383
7666
10374
20351
13420
19026
3991
16961
14222
6142
13198
17992
3910
19607
10012
4772
20830
1642
3740
10565
143
8707
10839
17523
11946
9119
9861
21106
11292
18562
477
7508
15283
17068
10126
9525
6212
16263
11183
19019
18301
12049
10673
17198
12369
20580
12596
16308
3302
20549
17632
20907
3296
1841
11080
5440
807
20206
8936
14545
14246
3859
17685
14698
3963
16
2253
4752
11439
15511
1636
11556
14764
4557
17756
5517
5818
4923
2535
5917
11531
7214
2171
12454
15402
10318
16057
16682
18986
16214
18954
2836
1208
12750
7786
12839
15878
20688
11684
7563
12682
10943
6081
10019
2321
1725
5374
12036
5592
20931
9948
2413
17510
11303
20200
19994
1881
16015
18924
21009
4664
6829
19696
2978
14691
17783
11211
6116
8208
4972
15174
4382
12448
7070
16335
19910
10243
3288
14285
14589
6634
19964
10707
12903
17237
19481
7313
13925
4764
2656
14745
14744
8148
17190
7253
14873
15516
11874
19624
11391
6376
12378
4804
9581
15305
16745
19189
8083
20935
4022
5264
1687
9624
13016
8536
16331
9498
13451
2445
17572
5359
9354
2450
20059
8618
7326
12287
18675
7190
17731
17194
10197
10600
9275
7974
2824
3748
5782
4095
6752
4860
16648
17010
11825
12734
1569
12175
12727
13907
8730
10492
19554
9635
9504
20932
11824
15269
9389
18332
1020
8726
14294
14592
2078
13947
19599
14773
15313
14912
18772
6595
11101
16795
2403
17798
19604
6205
404
15036
9882
8423
20983
8120
10933
0
12521
838
19749
16692
2663
20965
10559
8219
9182
3213
19423
17955
15110
452
4081
11842
4121
19112
19023
1584
19773
3391
311
4853
10190
17407
7307
16568
1840
17391
15153
3456
13596
9444
13416
16703
12455
19139
15469
10149
15220
13610
11588
1587
11332
13979
17684
1517
19841
9485
17215
11341
9427
20097
11895
20953
12592
3274
8900
1958
15956
4866
8856
17972
17744
6824
19013
14149
7579
19548
16481
2012
19532
3178
3286
7318
3840
3538
19310
16151
8005
146
2200
4015
7152
16949
11000
13154
9170
8116
1479
12814
6128
10362
2821
18216
5636
9595
3842
2212
15537
3715
13008
19540
11978
16612
16748
5082
3125
10163
9329
20111
16177
21166
8458
15312
20194
6778
4427
18833
21213
7748
13370
1460
12006
9690
6119
9970
18655
19758
15217
10105
8988
2654
18976
4263
6497
18088
18913
16495
19706
21122
20694
20863
2850
16337
12425
5086
1947
18137
19233
836
4881
21105
18627
928
14615
13238
20143
14327
9202
13616
12981
4811
19695
8965
5243
10613
11137
19593
812
8498
9997
19998
13935
15896
11020
19755
5976
5340
21048
3094
8205
4046
15002
2970
14651
12317
11202
11266
5490
9619
12358
13618
10437
1661
11647
16875
14931
17513
6811
16508
1665
1357
9788
6380
4103
6712
6315
346
10794
7461
20777
20152
10435
15880
20016
641
16211
19167
20788
8107
4956
19144
18861
20650
4308
14405
15275
7444
4070
6943
8048
4303
13718
17900
989
17130
13175
19178
3197
5232
13429
6173
12644
3676
13967
1825
7918
2977
17933
1100
11640
21222
8663
9150
5050
2293
4253
19523
13659
17577
11715
6849
2762
5116
8269
4713
9548
12924
10521
3624
14765
11021
10142
2998
3433
16783
3208
12087
1837
13404
10982
11962
9538
2320
4968
17524
14547
21188
4400
19724
14644
19655
3776
20735
11062
11090
18230
19771
14308
14291
3152
11001
52
20709
7855
19958
5202
1635
8756
12562
11092
10640
12053
8361
1006
14571
13265
20207
6428
9556
19460
3823
12514
8389
8696
13780
7543
18082
11884
21085
747
18415
14099
12430
14340
9927
12587
18537
10299
8692
6760
2415
9169
604
16445
18246
13772
4653
2677
1086
20721
6707
18506
7516
9592
16750
7929
10312
15903
16901
12971
16196
6886
8374
16317
14471
18643
19729
15801
15635
15695
13563
16553
6913
9316
9006
8908
883
10921
18818
1151
16632
19221
16469
3301
11902
7585
4076
19817
16404
206
19152
20614
19810
14213
9368
14588
2742
18098
5672
18752
15005
1096
9890
3353
20144
6872
12011
5047
15282
19742
20063
20677
2369
20256
19420
4973
504
261
4113
9155
11791
20645
1651
16139
17485
17809
4349
3008
11007
381
19920
4024
4234
14198
1922
228
19025
6047
745
514
7116
20011
15214
16478
1244
5716
15139
20171
17315
3099
17280
18898
6823
12020
13458
4451
4870
12054
2803
13778
2115
11336
3029
11799
14801
7757
15271
17708
9093
3615
1115
16763
11449
7435
13890
14685
18225
21060
1747
14727
10759
3374
5006
3390
4538
3162
3281
4879
15985
16123
9870
19231
18427
14711
8345
18723
6815
14731
14080
13761
12319
9833
13231
15982
11228
1218
19329
10702
17594
18859
8051
6676
5135
16578
10745
2286
20068
11807
20528
18114
15236
3244
5507
4415
11457
16143
18580
1564
15663
19887
18378
9477
3683
3918
6695
19449
10379
259
16792
7660
11314
9071
9325
16231
19288
6421
39
12063
9428
149
16818
17767
12268
393
14036
7646
5283
12957
12348
4665
7178
18079
12154
7827
19692
18949
10636
13681
12652
1811
8972
4794
11516
1038
12311
892
15557
10831
8042
15623
10222
7387
17445
14634
9207
16545
7336
17742
18540
4735
10651
5314
2006
21196
6302
10410
17902
17908
9065
6069
15863
17770
11119
13125
6431
11051
14533
5254
9710
11269
16096
19448
19484
18375
7988
20425
8760
3631
7908
14579
16528
13062
19245
8053
13151
4375
20085
4290
8933
14583
5625
486
14089
1050
20317
13580
8515
990
18816
13028
1277
1148
1504
9084
9863
9739
18071
2154
7673
21028
13386
7314
5843
20621
3297
11802
12421
11469
2409
8720
19072
1475
7894
17149
9004
3461
2979
14817
1580
18703
7328
4027
2045
16749
4274
5117
11814
12363
10007
17719
13106
13905
10106
3400
4352
20625
14490
14220
8227
16629
20608
1389
8390
6742
18530
10820
12116
12532
19182
8012
1209
3726
922
14072
17127
11692
18845
17702
20811
966
11134
8962
8683
2817
16250
6905
15228
1117
15142
765
18317
18904
8332
8703
18295
9762
6435
10004
15476
15752
19475
8671
941
89
11843
17884
810
608
1521
11995
15257
10823
19835
4355
12663
7688
13393
9297
4736
17976
366
15779
6766
3645
12542
111
14206
9540
5147
6571
16702
9914
8114
20038
9992
4153
7843
14608
6570
12690
5356
4391
17593
13704
2127
18388
6716
19433
17009
16162
10756
18069
19411
4519
8085
15531
20973
13247
17414
7250
14357
2130
17857
8799
5204
12848
19230
17556
3757
9472
10333
10714
3498
12108
2556
16160
1551
16033
2195
13798
17613
13662
7970
15789
13183
9783
17794
12015
13934
6944
15837
1009
9294
5287
10239
9622
6779
18805
8228
6974
10685
9749
3603
6202
18083
4789
20646
8495
18163
18777
15586
12503
12048
713
4354
3156
20272
3640
435
2268
14135
7709
7179
3916
18795
6176
19305
4512
728
139
12608
8497
11864
769
13922
8906
11144
568
17200
15464
6927
3828
11451
19455
213
17618
3658
5931
10185
3521
20028
5208
11453
8322
12270
10129
9643
19882
20662
9847
15924
15806
20630
19333
15407
14278
14079
19444
2938
13594
11838
3331
1325
10895
12665
12563
4178
3266
1877
20729
6441
11330
10711
3255
11145
2867
9613
18479
12944
6483
9569
454
12214
21070
2674
20964
5125
10634
13615
13033
13813
19717
11410
13560
5565
16581
10590
16790
8980
12431
3034
1761
12055
18486
10899
13762
9835
18099
8676
18214
15218
3006
4841
14916
731
9319
6689
1777
10064
20136
11339
10382
5597
4805
10638
19997
13531
15039
6802
5317
5534
13384
20946
407
17790
20431
1133
722
12126
16995
20415
4010
14733
15938
3443
11078
15248
12908
20601
9232
1618
20719
6865
20708
17542
11867
13055
5573
2196
20786
11584
11920
8210
6793
11670
3434
9390
7796
10359
20570
694
911
16542
8903
16128
7849
15739
11601
2530
15310
7522
8796
20349
14833
17434
3070
8481
2705
4116
8504
9347
5859
1832
15343
13526
16095
12269
19440
14825
8226
6960
10071
2724
14387
12061
19141
7951
12965
4260
3211
19469
19973
6386
3759
7407
11655
905
11595
12312
9080
16323
2528
4048
13578
20532
19503
15784
5010
14877
15276
2226
15064
557
16197
18961
7833
20328
15572
7550
9745
13633
9549
13509
8753
2893
2895
8367
8786
9445
11374
5194
3863
5532
5417
3426
3968
127
5964
20164
319
18140
9649
5699
5875
3415
14190
12701
13260
8494
10495
8298
4110
14041
20774
15455
2173
5881
16488
1724
18136
19244
1501
9135
1940
8644
13695
8834
19242
9448
6705
3059
5399
11629
99
4680
11461
8381
541
12462
1259
21006
17469
16378
449
15767
18827
8024
5960
6095
10470
12156
16340
4917
11529
17507
12553
2524
56
17837
18168
15714
12350
1326
10956
5801
639
4258
12860
17846
19238
9338
11899
8267
9962
9641
17855
12405
17944
19840
14317
11338
5495
13035
19467
12507
15958
8943
6362
17701
12878
17134
554
17581
11512
6931
17066
15719
19943
19684
18012
11414
826
18647
1846
4278
4806
2469
889
12449
4800
4577
9285
3275
20357
14660
15232
6652
15939
2251
7831
1809
6145
7592
2446
17476
11399
16315
13134
16439
17026
7487
5345
1083
18135
6395
21083
18361
8687
15725
13029
18346
20128
12728
175
14883
54
12792
5685
17835
2278
20424
3316
778
19404
6446
17336
16349
13122
601
2722
18147
19001
2142
2733
18460
8271
2628
19600
2693
7219
5187
12791
16272
21211
2306
4443
13250
7782
18839
8011
17824
17665
6578
4093
15590
2670
27
15073
13153
1775
10394
4173
2673
7598
14741
11520
7765
11219
11731
3949
9977
1114
15154
18800
4916
386
14988
11441
2295
3335
17776
12393
12286
16427
20381
21171
6270
14981
14759
1497
11130
3795
4990
7811
11220
15821
11658
20182
15934
13367
697
955
4309
16762
5518
19268
1844
4280
19690
11830
3590
18586
2889
14221
7041
11861
12075
15583
5657
18264
18880
3573
5632
8831
18788
16099
19913
1887
4460
11870
15716
11296
5228
16261
13972
12641
94
8650
7689
18754
3801
18583
8983
19723
1186
7830
2597
9953
7864
11940
19859
17898
11943
15773
12527
17124
12937
1669
9457
19059
4715
14084
7366
2356
7535
16185
4181
12658
7302
7367
18993
6021
1280
11669
10273
10040
16373
1620
9030
12726
4820
19232
4041
1205
1423
4559
15984
8598
16213
7229
8301
5422
4357
11473
12066
6004
10345
20769
18018
17369
2511
865
10515
14174
20049
17966
3384
18922
17352
20240
15364
1082
10206
16193
1387
15285
14876
2062
16649
12735
11708
18794
13562
13794
17730
12433
10342
15962
14739
9495
3153
3837
9946
3405
7443
13849
7538
1520
20910
2723
157
5730
7237
7410
4518
9203
15676
4329
13376
5904
13316
12602
15192
16757
17424
12718
13952
8565
18220
7652
12646
1786
642
8134
13318
5474
3140
14552
1615
10796
8712
14082
9980
19438
2616
14511
598
14577
19186
7114
10534
2844
19018
15379
1241
13545
19568
7264
17374
6106
14029
15693
20495
10859
10960
145
16735
2302
9192
1690
19115
5324
19870
8260
18178
15879
195
15199
17999
15811
9147
20157
2560
7298
5186
17540
3531
2153
5862
16420
12388
16704
6233
20339
14641
18979
15605
15710
6406
1302
6547
14071
6228
3496
4235
10809
405
9578
15771
16270
3240
18242
16090
12828
14074
9055
8520
6246
11720
19516
6890
17943
13814
7754
4177
1664
11760
6150
12404
6010
1002
14121
2080
4002
17355
21133
12629
1421
2825
794
10821
20218
2331
20517
2648
3095
821
9296
13412
17079
18122
1227
18564
3537
3710
71
1154
2545
2960
10668
8791
13709
10558
16698
20165
18259
5766
8969
18930
6750
3215
21197
2493
14379
1225
20293
10655
13646
11561
19885
20919
1074
2595
19634
12016
15022
16204
7417
1172
10074
10540
20942
11949
4701
15802
14729
19000
16693
7025
16941
14857
17969
2790
3607
14388
15869
14692
11891
5750
11102
10998
10510
10932
12273
6553
9509
16236
13987
4625
15381
10682
15861
20695
14958
4064
17539
16886
19147
15189
15857
5288
12875
18522
13127
3601
20911
18532
16669
15092
2134
16014
20253
16156
18713
135
7258
3674
17139
7678
19060
18254
17181
13927
20385
13381
467
13645
4849
4549
17410
2787
10852
2707
12490
2308
11162
16921
2229
9758
8564
16747
10880
21186
1081
8234
9385
4085
9791
7986
4536
15895
5748
13497
8606
11913
20147
11156
21037
6432
19601
10278
15307
14344
205
3556
8635
9468
16307
12880
7304
13264
8643
8978
860
13846
18888
10096
565
11984
8665
10307
725
20023
15035
6257
8399
13963
14774
10856
20857
9897
12284
3246
11747
5080
14011
104
3604
8781
820
4986
8858
3899
17400
15966
9790
10818
16266
5141
7315
13320
15149
2792
7555
5957
19153
5246
6936
16352
17203
14814
15272
10966
864
14609
3072
9566
20295
19989
16549
20327
12988
15496
8187
4896
4186
12765
20599
15120
179
9035
12446
21174
10360
4978
15835
19925
8735
7386
13715
15346
8350
18918
13294
18747
7046
8704
478
13192
13970
475
888
12815
12683
13423
5341
16287
9040
18291
10289
8977
9241
107
18504
4136
12090
6307
17053
7373
3349
7890
17822
15441
4671
3891
9377
1823
344
10611
7286
4857
15917
1203
7021
18167
8869
9820
1499
2022
17829
1774
1667
8882
18947
5081
11164
19255
2676
2452
15505
16616
8522
19299
7119
11348
14763
11563
172
5375
17658
17042
770
9960
20370
13230
11998
19796
15016
17165
20682
5693
20212
1273
9130
5719
6083
10934
16582
14497
1872
4038
14911
6787
19804
2544
4821
18688
20281
1222
15266
5410
11651
12818
2221
3665
6654
12456
6573
7846
3725
1700
11801
3170
11229
5578
7783
16359
1226
5621
981
4763
14161
1183
12614
19862
14900
9489
10950
19981
1589
12301
13559
3488
16460
3091
12402
4276
14106
1882
16499
18058
7914
3163
1950
8697
14086
17603
5151
5525
13001
4998
19546
19410
3789
932
16758
11402
12390
4058
6188
19207
2925
17766
14920
18256
11929
3599
13083
19797
6065
4697
1518
7134
1772
9636
16791
14993
16576
114
12224
9687
6198
16668
17174
13630
4635
12194
9573
4133
19661
8545
8008
5795
1400
17517
13884
20892
16910
17191
16135
12397
2521
12285
1614
21032
1026
9796
10157
15311
12675
14832
17421
15960
6442
18650
13722
19057
742
5559
11316
5472
16031
8376
284
2103
4344
15219
10305
18685
5063
2098
4551
16208
19645
12777
6454
14897
19511
9455
13432
2138
707
8961
13475
3464
14945
2263
851
20096
4527
20738
9049
10801
21147
8970
5062
12645
1796
19321
20548
12929
5209
5983
5921
4599
11823
1821
17875
7874
18040
11151
16006
1641
17795
4497
8262
3802
19422
13611
350
12512
18081
19579
1315
3882
9388
7617
11070
2351
15412
2697
3770
14168
5064
3883
5313
15499
3934
764
8512
9904
15957
13836
20276
1393
3483
14611
6058
4161
1283
8182
4987
10460
11604
7958
8525
18792
4964
4636
15490
924
12879
6400
10196
4946
8192
9274
8119
15741
9470
19205
12391
1634
1351
5461
19028
16809
3670
801
13197
5681
8121
9801
18001
7204
1206
2215
7609
8909
7865
17016
3074
17903
17351
15533
8780
13585
21159
14826
13133
13939
18193
3557
17260
19149
7222
21072
3237
20139
6464
6220
6567
11283
14299
8065
2491
19580
2390
11871
10139
18031
20056
7097
18231
11074
7110
18550
19659
1892
9867
3113
4852
13100
19892
8896
11906
6621
5244
16325
7210
8699
7234
3225
12206
17082
7059
14402
7807
4405
9219
18750
14653
13701
20913
12321
12216
3743
1867
15959
19493
17431
6208
12633
13241
17839
15049
14489
4910
754
13289
13307
9299
835
2744
216
10924
10166
15722
3104
2527
2884
746
4619
2272
14967
11147
191
2373
3467
13820
21061
13581
2843
4242
16397
4371
6591
13295
226
12400
8318
1763
8422
15847
12088
14990
16583
8022
3124
4322
16998
15056
16136
14024
5456
6332
18870
14802
7923
6125
10566
2534
20686
14075
10667
18419
17447
7163
3151
7425
852
7558
17639
1324
6743
3941
5073
5447
16761
13334
20585
20042
8101
161
18418
9617
3396
11465
1870
18897
14865
7445
15772
8611
2467
13527
11037
16724
4696
19095
11926
20948
6455
2875
6771
9191
16690
21000
4687
10340
33
14097
12925
18760
1695
14800
20773
18115
12149
10918
12481
9116
9898
7331
11113
16487
20125
3854
6266
19521
8245
11120
14155
18927
18546
17244
8235
7566
5106
12439
13716
20029
7738
1374
2146
6076
1730
16589
17056
13107
19361
8623
20642
4227
2468
20864
6875
9002
8486
3190
547
16765
19873
3146
2218
8728
14184
7618
3727
795
17261
7777
7091
18164
5876
21020
17734
8939
20051
19345
20149
7037
8931
17342
18601
1138
14543
20981
8851
528
1355
19663
3942
18903
9321
7520
4567
15723
15479
21088
4332
12889
18527
13202
19308
4610
11836
8069
399
18207
9100
15112
3407
3509
9359
4951
10964
5289
15948
15425
15768
19437
9106
13032
6557
8668
9786
6288
7922
8212
8490
20801
3051
2458
9379
15144
11423
1144
4828
227
251
8159
10331
855
2339
10020
4
17307
2917
9372
3096
4337
5248
9206
19118
19300
8089
9995
15488
1899
6342
8328
16421
2018
14389
10151
5873
4904
2190
19501
11525
1954
1577
4514
7374
19430
15931
14381
6819
1468
4802
1666
12300
12554
13410
70
15703
10726
8308
5297
9528
2581
2596
8737
3066
10734
8438
1359
313
5732
9132
1341
5110
12639
16117
11776
17088
17906
2005
8947
614
2496
13748
12891
12790
7084
10094
9138
704
11364
18491
20526
12067
15617
18192
15554
19271
12669
19319
8807
167
14823
6451
753
7355
12543
10110
8527
13331
19693
19848
11901
8096
566
6146
16517
14263
2833
13251
17737
2353
5235
6782
935
17368
2303
14067
11104
9430
8312
11615
18396
13024
16411
18696
6374
20013
14663
797
3089
275
10876
1744
2907
16502
13047
21134
14167
15987
11238
12952
21191
5686
14356
15336
6532
10287
7572
4521
9877
10728
18678
11649
10688
9264
8359
21179
19086
12977
6241
20853
14561
17167
12670
1507
20576
5831
3529
4135
11976
5079
11535
7200
8894
17762
6113
9871
12802
5999
20980
2255
3800
3779
18075
21017
1979
2506
9760
6354
2740
19743
17180
13901
16657
1779
20287
4283
17661
20754
17739
16621
8997
16433
6683
5977
18338
11925
10154
20022
18431
18440
17071
131
16516
6064
6259
16787
6082
6368
18321
14256
11497
7001
13044
8963
17670
4433
3637
9198
14194
3761
7036
11820
17371
20344
2204
1879
18464
6158
7485
3233
21109
19031
4446
2166
2739
16443
3628
18074
1548
515
6014
5066
2382
8155
6261
7530
8783
20610
105
14151
4694
19680
18383
3330
1471
10862
5552
4501
10084
9494
16265
16666
20974
17397
1125
19791
3925
644
6797
10812
20430
337
18281
13282
12886
3346
15926
11307
13754
20075
6904
14899
8457
14927
16930
21148
18497
16726
4165
18841
9821
17107
6267
13730
19605
10227
13739
14809
3293
11243
8499
2394
3040
15621
16630
10371
13364
14554
12338
1652
1888
10232
20434
19822
7284
19396
5807
18531
12857
9400
12022
15792
19063
16269
5184
20933
7220
469
13454
7645
19906
10784
7353
12109
19428
1477
6194
8886
3106
9484
17426
618
8992
14386
727
6489
14423
20889
14578
2002
6450
8100
11097
9474
12201
20367
7753
20512
11127
6545
20655
17163
7819
17038
10176
14124
15204
3681
20486
14015
11210
6664
7466
6638
9956
5402
1486
18844
5123
17819
9237
5210
11957
10245
9413
7594
20766
19009
20210
6118
20506
1256
8758
7260
328
8166
11983
6420
3750
18796
19106
8798
4705
9168
3358
10169
15564
387
10505
6503
18336
18745
18123
7957
4039
383
18889
5290
4005
351
13054
20197
14043
3254
16442
13832
729
5370
6155
8329
4825
12247
11762
6917
3903
3175
1746
9078
13276
2423
6392
1381
12235
12432
20043
15911
14260
11227
20455
7720
18095
2944
10687
7614
6998
8293
21149
20228
15303
8310
8323
14017
18883
16548
6469
17147
4373
8784
6955
12212
10448
6517
14616
20720
14073
3364
3393
18671
665
17073
19854
15800
9991
2020
19660
10892
6218
20791
10439
15255
6370
211
3317
15790
9759
19177
15853
20140
13421
9823
20718
733
2265
1609
11258
8914
14886
12271
19787
4516
20320
7729
7029
13222
11064
11706
16779
1175
5530
14311
12428
12719
653
7877
18549
9200
7108
12229
5994
7503
3995
1851
6232
10475
16296
16756
7480
20232
11049
5336
11528
14335
11044
4884
10780
17573
10101
13011
9073
11585
4468
10187
3432
9542
14105
13880
2777
20698
7285
1333
6637
11835
1238
13052
16000
18579
15420
15459
18465
5814
263
5501
20490
16114
20990
16430
655
21111
3956
2879
630
6900
14852
5386
14297
9352
17195
8519
8062
6928
1728
12549
14111
9541
5514
13660
13290
4738
13872
1463
2737
19954
1461
9869
4351
8990
6518
656
16785
19217
658
20551
13337
20563
1127
3836
16896
12365
142
4115
17318
3694
11259
12694
587
11745
15006
375
18245
14406
18416
11480
20536
9246
20142
18402
16191
540
15245
12689
6215
355
5803
20361
388
2542
3021
6359
18302
10917
12949
9038
11502
21087
15829
13252
15581
17873
15992
1156
6281
19363
4915
12575
19953
8708
16146
14139
4033
13637
15659
18963
11575
19698
20443
18557
12038
1783
2719
4611
20196
13240
5451
12945
8825
735
6430
17356
7075
7624
8543
15314
16048
638
10776
7792
10443
20394
7107
19246
14426
16700

12371
12793
9633
16835
17979
14473
14276
4341
8562
5070
2420
6251
7608
7238
13215
20334
8300
18420
6693
11294
3065
19125
1792
8236
10058
2407
14267
21169
6660
16736
7402
16292
17538
867
4299
2004
5349
5310
18392
9615
12198
13691
13893
1936
8439
18390
20908
16695
18229
6726
6678
5109
6696
14549
6472
10519
18188
1487
8136
7422
21102
5684
11627
11234
2299
548
3077
14754
16251
12862
8117
803
8102
5742
22
17106
10484
1928
10984
15299
2029
9972
17169
7066
8482
2829
19265
7712
13103
1234
1164
17604
11950
8667
3634
4105
17321
17862
18062
9016
10202
20260
19949
1575
5764
10067
8845
17995
10172
18258
9803
13037
3765
13764
20004
12231
12027
18843
16482
8401
17625
10033
5465
12528
9777
6415
19032
15046
18352
7055
17774
339
6020
16918
916
752
10321
564
10006
19343
16996
2501
11129
20000
7972
17780
16619
2669
12510
19267
4345
2137
1638
7817
2783
9753
1296
11590
19236
18162
11523
17299
5673
917
11907
15522
19338
17278
1787
5247
18895
18951
6690
5765
10056
16926
18441
4199
3242
8339
18181
10311
1929
12720
3623
9971
3064
16562
14003
4958
5993
7054
10849
12556
4759
12434
5074
3247
2942
11753
12274
9663
15770
645
15701
3298
7341
17676
17668
7266
18500
10543
16333
6813
15247
428
7883
13508
5284
20657
370
15954
14885
530
563
7732
6544
17329
15548
6558
668
8700
16240
20371
18408
15834
13072
14042
10171
1624
1314
12021
21026
15803
18046
4542
18944
349
9735
10885
9223
6881
16917
12585
1975
20159
3707
13070
20762
18035
3280
14445
4920
18421
4650
21058
10344
9594
4831
15156
11868
12136
10402
12341
3325
2156
189
17179
20632
18907
4552
8850
9189
11758
7559
1441
19492
18299
3207
14076
17396
11521
20663
20407
7126
5303
3618
8335
17133
10208
1221
551
9415
17037
13944
19606
16403
7540
16245
20481
17358
1248
5275
15175
5459
2918
12189
13225
15062
1131
5352
12973
10968
2612
4865
11226
14751
16909
4082
10195
12236
201
19611
16161
10723
9317
10277
4040
19884
1399
13498
7604
13881
17018
14699
19010
340
3261
15044
14354
20825
20914
11959
3764
19666
7089
359
9558
18892
6899
856
5886
18244
19318
13747
16091
2623
8600
5542
9648
1290
6918
16804
19364
4498
9397
14597
20432
21192
19505
15904
101
18611
21104
13777
16837
13463
14007
18052
3035
6411
18017
20567
1185
10367
3090
3053
15634
242
13452
5034
14730
6627
11408
4782
7109
8060
10021
19947
5476
21143
7714
6965
736
19764
9681
16013
12491
4955
7946
17157
4620
12803
19058
15631
6275
2815
40
14964
10209
8566
9986
19044
5825
1265
14813
20987
5416
673
12498
13126
4962
12573
5915
15894
11293
18698
17069
13450
6616
12810
902
8049
20543
12447
13962
1427
20104
1429
5773
8658
1370
8003
20905
8899
85
17844
11805
9363
10162
2112
8450
2590
13352
13485
7527
10911
16216
16734
789
17877
2133
1875
14275
9502
3696
5196
14776
20748
7564
10502
13793
9313
13827
5570
4898
919
9018
15442
3230
13732
1484
12346
16563
8629
7836
3739
7291
21064
849
4484
21185
15337
3078
4367
15008
13840
10153
5128
10875
8870
17375
5419
13949
17868
7325
1579
19519
16448
11321
5326
9137
7815
11375
8198
18680
10168
4051
7381
4401
15099
19911
20395
7960
13515
18161
15819
6945
5758
2505
2178
4762
10375
10568
5178
6413
15327
8741
18209
4286
5358
17968
2870
11035
4431
19273
6391
14639
3493
10319
5182
5429
5580
12713
8109
7517
21021
674
20457
1757
14188
8139
6508
12143
6537
5650
15943
11844
2831
16360
15169
8063
20510
8327
3902
1799
3102
20606
5794
9394
12483
4159
16511
14710
6510
14154
8855
5914
13617
18273
13555
1412
14972
5398
20498
7275
7774
19993
7948
5321
20807
3196
17895
5159
6108
12809
19990
3664
18217
15905
15253
19986
13233
14603
471
15115
13408
7357
20638
17498
9520
1778
8508
13974
18
1921
4991
5039
17335
16774
5988
17852
3571
6617
385
13113
1862
4335
13809
2842
8966
20658
10350
8729
2484
3502
6867
18240
9964
18170
18681
13818
18105
10286
7653
7582
17273
11897
5355
16319
144
14928
1403
9320
1349
14382
20345
1334
13885
10514
12678
14411
6924
6784
5727
9973
19945
4170
21175
18021
2216
13628
13111
3361
7457
15907
19098
18061
9587
3506
7536
15818
10034
11955
16221
19050
9797
17558
10781
17942
4268
8878
18664
5464
2594
7900
377
9526
7303
17977
4823
8622
20025
995
19621
15787
18182
18960
3671
1034
7717
4222
8480
276
5963
18972
21029
20598
12536
3944
6424
3413
3058
10785
7505
5645
3054
9194
10102
19463
9366
12730
7242
9059
576
14116
7071
1350
13613
7006
11349
16963
2287
12205
3931
12845
13567
1924
8207
8871
3378
1458
19701
12732
1704
9899
8436
4397
552
2784
18224
13911
8398
492
19462
12248
5689
10652
20409
5637
11175
15357
20637
5544
18151
13456
6934
11279
8655
6759
6885
11850
8326
7898
14682
3404
2706
15643
20534
20676
7470
14982
4359
7589
13207
1593
8645
20473
19495
4031
13892
8561
16838
16249
20574
1231
9464
19280
15750
18694
16303
384
13583
8018
4297
8259
10725
16361
5144
13874
11481
21217
16741
6296
12395
4162
20553
19380
4839
12921
1449
5692
17881
17054
846
6580
8898
7655
15360
6027
8599
14457
20934
20297
9868
11587
2205
14458
16462
15250
17012
18296
14863
20838
20041
13486
16903
9284
20781
4262
2476
12290
19176
14602
7872
7187
10009
12342
4018
86
18287
20925
12668
14347
18667
15906
20280
3438
11797
918
15826
3585
9798
17584
11008
21218
7562
6948
4993
7730
8782
13977
14509
5134
13234
3755
7880
16856
13995
817
14337
4147
15150
16484
14881
1672
7838
21114
8184
15685
17526
15440
3766
4448
10708
555
7856
10913
15589
10739
14687
11683
10308
15113
210
3334
11672
6855
10715
20772
18261
16891
14418
16525
20988
2474
11002
631
19143
324
9934
307
13071
5709
5307
19325
9197
20702
3039
7352
17954
1267
18311
14186
16994
703
13900
483
2290
20089
10737
18842
215
4377
4154
3998
19045
2371
15378
15368
20880
20545
17948
9440
17482
7606
2599
4326
18855
10795
2030
11513
3636
18502
8357
12461
14453
10988
13074
16836
5725
14342
10314
3347
20335
11855
6409
15013
8955
16039
15809
20289
20491
19633
14539
15444
17962
8185
11045
15494
10680
15653
12419
13894
14235
16564
14117
8837
21119
686
5615
5738
3451
8449
9822
6952
8463
10909
3075
5609
3698
12986
15162
8264
6942
7534
9814
16641
1192
5265
12322
17941
10031
1805
9842
11286
7416
1473
21099
9282
12767
3551
6324
7045
3685
6847
15143
4930
8666
20117
9304
5033
11923
17232
5431
8827
19555
1301
6861
2583
18154
15000
561
6989
14026
2793
18832
11953
2478
9245
4628
338
12296
15107
20712
5118
6097
7471
20993
2412
1320
9188
5735
4676
19314
19718
12293
13447
7871
10282
13917
11569
11272
6933
16711
5947
6159
5596
1662
12113
17239
14628
9011
4608
15361
5867
18761
1994
8265
5869
9978
19395
12367
1165
12407
14333
16798
7625
13446
17419
1289
20386
20008
5554
1095
20504
11539
2327
14613
17952
6141
15024
18912
842
4827
10804
5817
19069
7185
8434
5752
10348
13212
6862
19518
11987
19809
7680
9216
2488
20852
18936
7808
10981
5230
4479
17214
9838
16770
13227
15539
3554
2627
1122
20835
16409
9691
37
5030
9586
20775
10735
12685
908
20399
3688
17394
10353
21116
12132
11087
13766
14364
8594
10001
294
13237
1903
10471
16097
13812
12895
10709
16627
2176
14339
7295
4053
13796
4565
808
3180
2904
8754
16780
3406
2769
12460
16990
11809
13253
19510
5455
759
8849
20034
1141
10527
1066
11152
3648
66
17865
16544
18043
18435
17052
18751
13169
2901
9938
4102
3270
9103
13312
18935
6154
4148
16676
2472
9702
11711
10802
1140
12208
7524
15419
5855
4384
550
9640
1927
19349
11267
1153
1446
14160
9711
18821
17293
5148
16334
7947
2024
18116
12854
1017
534
19490
7893
4006
367
20943
6404
14598
2388
20820
5387
5937
15970
1678
2341
18809
6509
2017
5723
12265
11125
5240
20873
17382
12598
1121
2061
7926
6506
3013
20389
16279
18606
6100
11466
18189
17590
9222
409
10335
14573
2509
10743
9213
21162
3994
675
17726
6175
13118
8627
10978
5922
17212
15129
17282
15972
4587
2653
14550
2809
14439
20084
3972
1190
2271
18169
3984
5174
19891
9424
4647
21076
4675
3542
1338
5212
10731
11429
10391
9365
10542
4775
19254
16989
577
9044
18735
12340
14108
15472
2060
4761
17376
7023
14443
20944
16290
7385
21073
6515
20087
10942
4358
334
3392
3428
6864
9026
13461
6796
7699
16557
14926
9131
6206
1967
6795
6783
5351
13017
3329
13209
10409
1300
87
20377
19700
2056
12174
17548
6788
12637
3932
4348
7138
6179
972
10045
14559
4187
90
4950
17451
389
13797
4129
6589
8556
2000
13908
20904
12078
5019
20597
2785
16382
12852
5590
19372
14905
6605
151
19722
1137
19435
8454
5376
16134
15613
8603
12259
11608
11763
20471
13042
20133
6731
20631
14891
17343
8282
48
2622
202
418
20810
12453
16592
14932
19922
2865
2475
15654
8066
11905
11573
217
11462
3990
11676
6935
10238
5199
4068
2708
7698
6527
10164
2562
6579
21033
7939
11427
20438
18933
9813
2994
9714
18366
16954
2806
8677
3741
13622
10889
8589
9493
17918
8380
761
901
16932
12820
660
18565
881
8045
7676
21054
6536
4424
1291
19777
10732
14849
6323
10700
19442
9773
14892
5180
19748
16365
17728
13216
5037
17511
17340
12684
1698
4486
7568
5433
11392
13891
16209
18176
14786
19471
8431
5130
7998
15544
1943
18539
67
10220
13112
16187
14178
17300
20461
14500
758
15448
20185
18573
16599
11315
17117
18749
10458
11619
3314
831
12771
8362
11510
9926
21123
7223
2307
9564
7546
6355
7016
5055
4895
13357
2610
11223
3172
14697
20571
18654
20778
20493
9544
9671
5569
12051
6328
1720
2968
17672
18615
3369
315
12656
246
1574
2050
3527
11739
7719
14173
16252
6358
6490
19751
15399
16170
19002
6295
8656
12225
6800
3276
2040
7619
21079
12032
20474
1537
13752
2838
3848
5282
11440
17201
8007
3311
21036
975
17696
19137
10843
6629
8865
6031
7390
11597
16729
12548
7209
18831
1795
14563
2421
19820
792
2549
5124
17450
17617
13656
16667
17845
15201
606
1797
15664
12074
3149
20578
17566
1413
14678
9212
16823
15721
16766
11362
3055
17367
8901
16602
18668
11618
11526
11550
6926
18697
1150
16280
11956
20845
17172
9048
20467
20960
15665
13137
2766
11916
4179
6982
7233
17669
16573
18472
19096
17901
18478
1926
20885
4461
9738
9331
5473
15530
5088
7324
20065
18533
945
1282
18145
3241
11829
13505
18078
3417
10414
9794
9384
17112
15392
14189
20184
15185
14210
13292
14655
11131
14217
13213
7099
2684
7746
6962
14028
12153
7103
19038
92
6289
11297
6311
600
18556
8879
11095
8559
21095
2259
16244
8451
20337
7775
543
5334
8161
1490
20888
8774
3030
3103
8890
6438
15223
9324
18644
5824
19940
4232
14150
12580
12600
19533
9288
10436
874
9090
8493
8372
1243
12567
9539
2602
20671
13226
9682
14040
10614
11280
19575
2386
6912
20558
652
19711
20214
15780
4233
12763
9756
2301
18468
2589
10097
14131
8864
9287
12457
8953
13605
6727
20896
9618
15328
18417
2846
11681
19704
17373
19145
5804
17746
3606
10066
10916
5968
9431
20533
14438
5347
18877
12040
17840
11970
12672
9672
6053
5608
1211
19799
7297
1588
8695
1540
7537
14482
16437
15536
7011
14819
3477
10434
13178
3818
1179
11201
17946
20153
15743
5535
15998
14159
10423
5449
2794
5392
13683
17236
5044
4596
3401
9929
7375
9965
4612
1339
14241
14725
15450
10108
11817
3975
7474
1298
18939
9924
348
19405
1382
9114
11048
5286
20458
20771
5087
5421
7514
9289
5606
18676
12095
20188
19088
13807
19136
1018
3584
10380
8082
4977
11282
12277
7919
7052
3639
14861
20538
12966
10629
20844
20784
4023
20530
13676
20392
8593
7263
12398
1912
14103
10766
14269
1235
17288
7327
17757
10128
9658
2780
10721
7321
8555
7602
460
7393
15203
2429
12188
7560
3159
9491
14176
8722
2919
18608
10499
15858
18404
7711
279
17462
34
16465
13621
15241
4914
8369
14619
8577
15763
1808
9356
15229
7256
15830
20447
20003
8232
724
10433
10119
12741
12704
3117
6476
9025
14510
1923
2845
2033
1217
14898
15146
4327
1331
19849
10581
15434
16813
5274
5978
358
19926
985
15842
2502
14787
4885
3245
7734
3561
4458
15351
8802
9057
4966
16370
15057
491
13099
19839
10509
6169
815
7496
988
341
5167
5700
9459
18899
13768
12288
16451
9858
18476
5251
6577
20405
1599
5059
13869
19688
16743
5992
16638
7267
893
1136
1601
17001
5061
2666
17503
17317
20854
20205
21193
10274
4438
17778
2123
8098
17231
17889
2316
18774
11643
15660
20294
15123
1957
5482
19173
5943
15961
17974
13144
13397
15095
10271
16461
12624
16981
1987
969
1372
8826
17892
13864
17277
13401
2194
1344
5364
4638
19047
21018
17554
2387
8749
12191
6178
8091
20116
10260
19526
10488
15265
1833
9235
203
2854
2471
9516
18534
14314
798
4787
13824
9069
14694
3879
14066
16855
8221
10646
9454
15191
14369
7961
2963
1789
7736
16916
18756
6675
9255
424
5783
17303
76
12258
7005
12409
8046
16094
44
15730
4152
9662
17994
5346
3004
20416
6767
7150
1108
8016
20403
13675
7004
3699
837
18738
14665
12729
10218
8170
1052
13138
3792
9944
11705
3436
19327
11939
17270
13115
9841
10329
18023
616
10275
15292
13182
11572
20021
16165
19869
1621
5746
9419
10310
20078
13063
5835
16210
20626
17991
14512
4459
19614
18190
5833
9974
7913
2921
9892
21136
3550
16025
19874
15786
15075
18588
5726
535
13057
9611
9337
9151
1139
4760
18846
6149
1764
18516
20055
14624
15909
237
17563
2564
12401
6029
6085
18879
7891
5926
3892
3093
15003
16985
2718
14570
7978
11852
12334
12221
1001
15680
20462
14016
926
17495
13405
1675
14593
6937
1261
11571
19589
15237
12352
18143
14122
19855
2079
25
8348
2858
10834
7095
4660
419
15778
9598
18315
15919
18213
16982
11448
9746
2141
3206
1084
17247
4069
10539
8779
20459
9205
17925
8636
4982
1442
2096
13187
8607
13740
10493
4447
2368
2198
8592
10280
9604
11058
1174
763
17614
4996
8237
9894
13522
9387
16650
9149
9853
3718
19317
11463
18483
10887
11141
950
2174
4994
1472
36
17454
3326
18364
10778
3512
2254
6529
20001
3315
1197
10676
1645
2193
6045
19263
16011
4231
11722
5845
7078
11163
2631
11063
20285
13012
18945
15824
3851
11606
3239
599
5443
9787
10574
17519
7639
5450
11054
342
13883
18195
19104
1145
20069
17205
627
17571
18651
16609
17856
18237
7039
16642
12738
12625
3344
12709
7695
20484
3774
5973
1863
4307
14179
21
9110
14758
14872
12996
6008
17210
13738
15749
413
10653
5864
1556
8716
17257
8461
10567
2443
5849
4989
16453
18884
18197
17810
20525
8948
9883
12345
2192
750
17689
9462
1752
18868
14238
19826
2951
249
7361
12199
14781
5406
10681
13763
2691
20805
10182
10929
2395
4953
8537
8848
6143
19037
14853
10722
1804
14234
7944
10295
626
13349
271
18721
1483
14380
7801
11285
16402
3955
10896
16324
17694
907
757
10373
14929
9913
300
13572
6761
6534
8368
6719
14866
12436
8196
20329
3148
6129
661
17062
9524
15466
1977
7113
8140
1776
15447
2570
3045
1157
16740
19128
5218
20083
16413
8916
15439
2184
12770
13816
16840
4259
15121
5585
16380
14399
6665
13380
5095
4983
5077
963
12408
9381
6949
8830
20615
15183
12953
1513
13943
19017
16935
529
5494
6356
2252
8857
17621
10417
20241
11729
9303
18367
4277
7123
21198
15708
15584
20706
2120
3952
17196
6612
13478
20744
4835
20814
3262
1106
11574
9190
21022
17067
4711
12152
5644
13005
321
4721
4731
12197
2431
13625
12950
16708
1800
14827
15296
19253
4724
3307
1270
11262
2044
4488
17267
12959
9562
19637
5168
11416
4412
330
5502
18407
8295
14505
6230
14700
8548
10612
5972
5840
14941
1187
4504
21050
3595
333
8190
15845
17078
5924
2734
1689
1247
9482
1529
18399
13896
9848
13687
6898
19844
13344
13350
15400
20898
9478
7072
382
2013
15922
18610
5331
9817
5954
12907
15632
5567
264
19650
4146
18175
12650
18359
8346
19488
10112
17081
19948
12192
183
13769
11788
7511
13174
6745
12045
17036
15658
13985
3687
14856
2804
19313
3469
8127
9785
17828
8351
209
11492
6387
10046
18010
17412
1553
14600
12893
5809
2480
14
7044
14420
19099
8974
7028
692
4256
4728
2318
3138
12438
5239
17760
11665
17357
9122
6513
5823
10358
16316
10130
15764
10327
9889
13557
9373
14444
15151
17471
12217
19915
20227
16130
10028
6403
14707
3702
956
14835
17481
11076
3236
11641
3602
12920
4582
4817
12260
19562
7788
19030
12485
6915
1842
16464
3869
17743
13347
9891
6009
12355
4934
14057
1240
7674
3644
18118
11636
14365
9550
1476
6932
8535
9837
13624
14436
16567
9776
11195
7491
13210
17663
16556
8930
14968
13235
6679
1932
18959
15224
4478
8793
1080
12539
20785
5389
5152
2376
11632
2435
12621
10221
4207
10906
14306
9185
1099
12368
10026
21043
11189
1734
18602
14048
7779
20018
3147
16501
20173
11519
10967
9453
10095
2848
5539
2972
14889
15333
6381
17569
15902
20479
14750
6140
10183
18013
16218
15603
5900
13787
15952
14470
6418
12084
2567
9370
12535
20949
15485
11240
15383
16256
19756
7086
5214
21206
15353
14060
18235
2529
16344
20995
360
17610
15117
4562
7702
10513
20768
10464
5260
168
305
17843
18768
1505
17567
6043
1742
8767
3139
18864
2381
3700
18548
17383
10131
11626
2579
18825
11827
16504
17224
5413
13059
9328
9142
10055
4020
5149
19114
3598
1469
11534
8959
18513
2298
18684
3610
16144
10779
1758
18876
9302
3653
4477
11213
15356
15553
14894
6019
3587
13879
4301
6584
19999
19928
4469
16230
13418
13348
9174
10952
15122
2786
1949
16624
12187
14008
558
726
7476
16883
14574
1327
13790
10622
4602
4340
19150
19924
15839
13921
9
8634
9340
2441
17847
5411
14734
19235
13992
3497
10914
7280
19967
10508
5278
7376
16894
373
2389
9395
8
11693
11918
6412
3115
9128
1542
858
5249
5437
10633
10303
4047
15587
4854
4842
20697
5751
3016
13069
97
20660
14101
20154
320
6684
13090
17543
6122
10782
1878
10833
8654
3371
909
3412
11811
4270
13329
12707
12506
17821
20113
3100
7257
17781
17207
13375
12914
3523
4306
6648
11532
15118
8477
920
4240
13365
2249
18369
16960
8462
7383
17890
3017
19652
9218
9439
7368
15506
17455
11741
10125
14614
7159
7761
8015
5965
18783
18519
18773
3790
16673
14794
11985
3756
12085
421
19005
3775
5874
8633
5942
16175
15277
15487
9036
12574
6582
19737
16053
7441
666
4402
15883
7810
2461
4622
5361
732
7048
12868
9781
376
1249
4748
18064
8285
9647
17869
2165
14494
4012
4269
20466
1874
1503
4572
7644
7772
1313
5591
7299
5166
9058
17226
16593
5158
7281
17758
10107
10874
19203
2014
8929
53
12516
1607
8073
6599
14390
16978
7853
12568
11607
2536
14986
15009
4014
20489
19159
13848
18956
4130
17339
2864
2270
4945
14372
7261
1917
602
13256
18770
77
5906
16295
8764
6531
5221
4158
21100
5697
18451
120
16388
6133
4729
16636
5934
6264
4111
7227
10561
16685
14772
13201
15382
9129
8824
7128
1919
9021
5504
17442
4366
18141
11559
17989
16124
19219
14791
21014
13377
6339
1859
12292
16598
8280
17564
15366
20668
2405
16660
18414
224
10421
978
18184
20726
4699
7431
10601
15176
14295
1766
19747
18033
3763
7247
7274
3352
19676
14424
6561
9109
4807
17007
14689
4054
15528
17518
13566
7050
12166
15031
15766
16760
14228
12604
3229
546
5987
8291
15988
637
21007
8158
15067
5694
11042
184
4656
20446
5133
1572
448
20749
15088
4695
12764
4328
16148
8922
20872
11898
19574
16841
3877
18410
7486
11660
20468
19227
19201
4657
5582
16524
19075
11938
15547
20237
16594
17333
18917
12898
18324
10085
19052
11370
6114
19672
17528
18990
18634
17089
13602
14830
19042
19008
18547
16625
4887
3974
2049
8539
11611
8518
4692
11733
11306
10290
10855
2910
6685
782
6611
8313
17876
13808
3269
15532
19140
6502
11088
21015
11121
1510
678
11337
6055
17784
15860
5418
2624
14671
2582
7687
6213
6859
7293
10292
4593
7193
11372
4323
7595
11389
19564
4422
12876
19515
940
3328
18233
17893
993
4727
13548
6388
8304
13186
15852
9736
11942
14771
11318
13870
11857
6548
7346
3252
3706
21158
11411
18921
13346
20828
1822
13700
186
14617
365
20155
18975
8867
8861
2459
7642
19965
19275
1242
13162
12412
15032
9993
18223
10207
17349
9764
8414
1491
8426
1902
14627
17290
8768
15433
16395
11357
3870
10644
1880
513
14195
15727
20848
18385
844
13297
7547
9775
20032
6340
16847
1806
2032
5009
2129
15318
10398
18428
11235
773
12396
17479
7332
16713
15458
11620
19971
6880
16565
16572
14232
8157
1509
10184
20554
3067
13806
3338
1930
4801
20010
2577
17891
21008
4909
14385
9399
10867
9124
19950
14757
1858
3173
5004
6026
10266
13932
15619
19079
17061
4474
5690
5093
10441
16680
9588
14919
13041
20422
11013
3787
2442
4141
21181
19175
17535
14690
18068
18461
5640
15520
16311
9561
2214
